iterate/iterate/apps/kit/firmware/targets/stackchan/sdkconfig.defaults
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../common/partitions-16mb.csv"
CONFIG_IDF_TARGET="esp32s3"

# CoreS3 uses 16 MB QIO flash and quad 80 MHz PSRAM. DSP state belongs in
# PSRAM where the library permits it; DMA queues and ISR-visible chunks remain
# explicit internal allocations in the platform owner.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# ESP-IDF 5.4 renamed the old SPIRAM option.  This merely permits explicitly
# selected non-audio tasks to use external stacks; the audio owner keeps every
# DMA/ISR-visible byte in internal memory and never relies on this blanket.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# ESP-SR missed its 32 ms deadline under the debug-oriented compiler profile
# in the prior hardware experiment. Performance is therefore a correctness
# setting for this target, while the linker size report remains a required
# artifact so the tradeoff cannot disappear from review.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_PARTITION_TABLE_FILENAME="../common/partitions-16mb.csv"
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# Atomic publication in PSRAM must never fetch the workaround from flash while
# the cache is disabled. The final ELF audit separately verifies our callback
# and raw-copy call graph; this option closes ESP-IDF's documented S3 atomic
# erratum path rather than relying on whichever default the SDK picks.
CONFIG_STDATOMIC_S32C1I_SPIRAM_WORKAROUND=y
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

#
# The camera's DMA buffer, held only while a photograph is being taken.
#
# 8192, the minimum this driver allows, rather than its 32768 default. With
# the default the internal heap fell to 1,275 bytes while the sensor was up —
# and every TLS write needs a few kilobytes of that same pool for an AES
# context, so a stats push landing inside the ~500 ms shutter window dropped
# the socket. Smaller buffers mean more frequent DMA interrupts; on a board
# that takes an occasional diagnostic photograph and holds a continuous voice
# call, that is the correct side to err on.
#
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=8192
